# Задача №1. Решение в группах
# Семинар 1. Ввод-вывод, операторы ветвления
# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.
# Input:
# n = 700
# m = 750
# Output:
# 2

# n = 700
# m = 750
# print((m - 1) // n + 1)
# print(((m+n-1)//n))
# print(abs(-m//n))
# print((m//n)+1-(m == n))
# print((m+n-1) // n)

# Задача №3. Решение в группах
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32
# a = int(input())
# b = int(input())
# c = int(input())
# s = (a // 2 + (a % 2 != 0) + abs(-b // 2) + (c + 1) // 2)
# print(s)


# a = int(input())
# b = int(input())
# c = int(input())
# S = (a//2) + (a % 2) + (b//2) + (b % 2) + (c//2) + (c % 2)
# print(S)



